In [2]:
import pandas as pd
import numpy as np

In [3]:
#Series --> 1d data

s=pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#loc,iloc
s[2:]

2    3
3    4
4    5
dtype: int64

In [6]:
#Series->1d data
s=pd.Series([1,2,3,4,5],index=list('acbde'))
s

a    1
c    2
b    3
d    4
e    5
dtype: int64

In [7]:
s['b':]

b    3
d    4
e    5
dtype: int64

In [8]:
s.iloc[:4]

a    1
c    2
b    3
d    4
dtype: int64

In [9]:
s1=pd.Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [10]:
d={'one':1,'two':2}
d

{'one': 1, 'two': 2}

In [11]:
s2=pd.Series(d)
s2

one    1
two    2
dtype: int64

In [12]:
s

a    1
c    2
b    3
d    4
e    5
dtype: int64

In [13]:
s['t']=45
s

a     1
c     2
b     3
d     4
e     5
t    45
dtype: int64

In [14]:
arr=np.random.randint(1,10,size=(10,3))
arr

array([[3, 4, 8],
       [5, 1, 6],
       [3, 6, 7],
       [7, 1, 4],
       [8, 4, 1],
       [5, 7, 2],
       [7, 4, 8],
       [8, 6, 7],
       [5, 9, 5],
       [4, 8, 7]])

In [15]:
df=pd.DataFrame(arr,columns=['one','two','three'])
df

   one  two  three
0    3    4      8
1    5    1      6
2    3    6      7
3    7    1      4
4    8    4      1
5    5    7      2
6    7    4      8
7    8    6      7
8    5    9      5
9    4    8      7

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10 non-null     int32
 1   two     10 non-null     int32
 2   three   10 non-null     int32
dtypes: int32(3)
memory usage: 252.0 bytes

In [17]:
df.describe()

             one        two      three
count  10.000000  10.000000  10.000000
mean    5.500000   5.000000   5.500000
std     1.900292   2.708013   2.460804
min     3.000000   1.000000   1.000000
25%     4.250000   4.000000   4.250000
50%     5.000000   5.000000   6.500000
75%     7.000000   6.750000   7.000000
max     8.000000   9.000000   8.000000

In [18]:
df['two']

0    4
1    1
2    6
3    1
4    4
5    7
6    4
7    6
8    9
9    8
Name: two, dtype: int32

In [19]:
df.two

0    4
1    1
2    6
3    1
4    4
5    7
6    4
7    6
8    9
9    8
Name: two, dtype: int32